# GetMaterialArea

## Description
Returns the surface area of the object having the specified material.

```pascal
FUNCTION GetMaterialArea(
				h        : HANDLE;
				material : STRING) : REAL;
```

```python

def vs.GetMaterialArea(h, material):
    return REAL
```

## Parameters
|Name|Type|Description|
|---|---|---|
|h|HANDLE|Handle to object.|
|material|STRING|Name of material.|

## Returns
Returns the surface area of the object having the specified material.

## See Also
VS Functions:
GetMaterialVolume

## Version
Availability: from Vectorworks 2021
## Category
* Object Attributes